
[A_AirMagic_Skill H7Skill]
mName="Магия воздуха"
mTooltip="Позволяет изучать в гильдии магов заклинания магии воздуха, а также усиливать их и добавлять дополнительные эффекты."
mDescriptions[2]="Увеличивает эффективность заклинаний магии воздуха и повышает уровень %ICON_ARCANE_KNOWLEDGE магических знаний на 1."
mDescriptions[3]="Увеличивает эффективность заклинаний магии воздуха и дополнительно повышает уровень %ICON_ARCANE_KNOWLEDGE магических знаний на 2."
mDescriptions[4]="Увеличивает эффективность заклинаний магии воздуха и дополнительно повышает уровень %ICON_ARCANE_KNOWLEDGE магических знаний на 3."
mDescriptions[0]="Увеличивает эффективность заклинаний магии воздуха и повышает уровень %ICON_ARCANE_KNOWLEDGE магических знаний."
[A_AirScholar_Ability H7HeroAbility]
mName="Искусный маг воздуха"
mTooltip="-%special.norm% к расходу маны на заклинания школы воздуха."
[A_AirWisdom_Ability H7HeroAbility]
mName="Мудрость воздуха"
mTooltip="%stat1 к %stat1.icon магии для заклинаний магии воздуха. Любой навык категории «Мудрость» дополнительно дает герою %stat1 к %stat1.icon магии."
[A_ImprovedTier1Spells_Ability H7HeroAbility]
mName="Мастер магии воздуха I"
mTooltip="Заклинание %color «Штормовые стрелы»%colorEnd позволяет наносить полный урон на большом расстоянии. Кроме того, его можно накладывать на все дружественные отряды в выбранной области 4x4.\nЗаклинание %color «Штормовой разряд»%colorEnd больше не наносит урон союзникам."
[A_ImprovedTier2Spells_Ability H7HeroAbility]
mName="Мастер магии воздуха II"
mTooltip="Заклинание %color «Шквал»%colorEnd дополнительно наносит выбранному отряду от %spell1.spell.d.min до %spell1.spell.d.max ед. урона от %spell1.spell.d.icon магии воздуха.\nЗаклинание %color «Молния»%colorEnd на 3 хода заменяет текущий показатель инициативы на %spell2.spell.buff.buff.stat."
[A_ImprovedTier3Spells_Ability H7HeroAbility]
mName="Мастер магии воздуха III"
mTooltip="Отряд, находящийся под действием заклинания %color «Молниеносная реакция»%colorEnd, наносит дополнительный удар перед контратакой противника.\nЗаклинание %color «Вихрь»%colorEnd наносит вражеским отрядам от %spell.spell.d.min до %spell.spell.d.max ед. урона от %spell.spell.d.icon магии воздуха."
[A_StormLord_Ability H7HeroAbility]
mName="Повелитель бури"
mTooltip="Когда отряд противника получает урон от атаки, все его союзники, находящиеся поблизости, получают от %buff1.buff.d2.min до %buff1.buff.d2.max ед. урона от %buff1.buff.d.icon магии воздуха."
[A_GatheringStorm_Buff H7BaseBuff]
mName="Громовые раскаты"
[A_GatheringStorm_Ability H7HeroAbility]
mName="Громовые раскаты"
mTooltip="%stat к %stat.icon магии за первое заклинание магии воздуха, примененное в бою."
[A_MasterOfAir_I_Ability H7HeroAbility]
mName="Знание магии воздуха I"
mTooltip="%spell1.name: теперь заклинание можно накладывать на все дружественные отряды в выбранной области 4x4. Бонус: %spell1.spell.buff2.buff.stat1.icon 100%.\n%spell2.name: теперь заклинание дополнительно заменяет текущий показатель %ICON_INITIATIVE инициативы вражеского отряда на %spell2.spell.buff3.buff.buff3.buff.stat.norm. Кроме того, заклинание больше не наносит урон дружественным существам."
[A_MasterOfAir_III_Ability H7HeroAbility]
mName="Знание магии воздуха III"
mTooltip="%spell1.name: теперь отряд, находящийся под действием заклинания, наносит дополнительный удар с бонусом +10 к %ICON_ATTACK атаке перед контратакой противника.\n%spell2.name: теперь заклинание действует на все отряды в выбранной области 3x3 и случайным образом разбрасывает их в окружающей области 9x9, а малые существа получают двойной урон."
[A_LightningShock_Ability H7HeroAbility]
mName="Удар молнии"
mTooltip="Заклинание "Грозовой разряд" дополнительно накладывает на находящихся рядом существ отрицательный эффект, снижающий их инициативу  на 1 до наступления их следующего хода."
[A_LightningSurge_Ability H7HeroAbility]
mName="Lightning Surge"
mTooltip="Заклинание "Цепная молния" выбирает два ближайших отряда в качестве целей для первого скачка, нанося каждому половину урона и лишь затем совершая скачок в последний раз, чтобы нанести четверть урона."
[A_MassStormArrows_Ability H7HeroAbility]
mName="Грозовые стрелы (общее)"
mTooltip="Заклинание "Грозовые стрелы" накладывается на всех дружественных существ в области 4x4 и позволяет им стрелять на полное расстояние."
[A_MotionBlur_Ability H7HeroAbility]
mName="Размытое движение"
mTooltip="Дополнительный удар от заклинания "Молниеносная реакция" наносится перед контратакой противника."
[A_QuickCast_Ability H7HeroAbility]
mName="Быстрое действие"
mTooltip="Параметр магии героя при первом использовании заклинания магии воздуха в каждом бою увеличен на +%buff.val ед."
[A_WindFury_Ability H7HeroAbility]
mName="Ярость ветра"
mTooltip="Заклинания "Шквал" и "Вихрь" наносят дополнительный урон от магии воздуха поражённым вражеским отрядам."

UCP MOD

[A_MasterOfAir_II_Ability H7HeroAbility]
mName="Знание магии воздуха II"
mTooltip="%spell1.name: теперь заклинание дополнительно наносит выбранному отряду от %spell1.spell.d.min до %spell1.spell.d.max ед. урона от %spell1.spell.d.icon магии воздуха.\n%spell2.name: теперь заклинание дополнительно заменяет текущий показатель инициативы вражеского отряда на %spell2.spell.buff1.buff.stat.norm и наносит от %spell2.spell.d.min до %spell2.spell.d.max ед. урона от %ICON_AIR магии воздуха соседним вражеским отрядам. Длительность (ходов): %spell2.spell.buff1.buff.durini."

